# ExternalServiceRegistry Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalServiceRegistry Class
Members See Also
---
This class gives access to external services. Use it to register external services with Revit and execute them. Only the application that registers a service is allowed to execute it.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static class ExternalServiceRegistry
```

Visual Basic
---
```text
Public NotInheritable Class ExternalServiceRegistry
```

Visual C++
---
```text
public ref class ExternalServiceRegistry abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.ExternalService..::..ExternalServiceRegistry
# See Also
ExternalServiceRegistry Members
Autodesk.Revit.DB.ExternalService Namespace